const predictions = [
    "Велика удача чекає на тебе найближчим часом!",
    "Сьогодні твій день – не бійся ризикувати!",
    "Незабаром ти отримаєш приємний фінансовий бонус.",
    "Нове знайомство змінить твоє життя.",
    "Твої амбіції приведуть тебе до великих звершень!",
    "Успіх вже на порозі – будь готовий(-а) до змін!",
    "Знання, які ти здобудеш цього тижня, відкриють нові можливості.",
    "Важливе рішення, яке ти приймеш, принесе тобі користь.",
    "Дозволь собі відпочити – це допоможе знайти відповіді на важливі питання.",
    "Хтось із твого оточення носить маску – будь уважним(-ою).",
    "Секрет успіху – в твоїх руках, залишилося тільки діяти!",
    "Нова ідея принесе тобі визнання.",
    "Прислухайся до своєї інтуїції – вона тебе не підведе.",
    "Дивись на речі ширше – несподіване рішення виявиться найкращим.",
    "Попереду світлий період – насолоджуйся кожною миттю!"
];

document.getElementById('btn').onclick = function () {
    const display = document.getElementById('display');
    setTimeout(() => {
        const random = Math.floor(Math.random() * predictions.length)
        const date = new Date().toLocaleDateString();

        const colors = ['red', 'green', 'blue']
        const randomColor = Math.floor(Math.random() * colors.length)
        display.style.color = colors[randomColor];

        display.innerHTML = `${date} - ${predictions[random]}`;
    }, 2000)
}