const recipe = ['1: Візьміть яйця.', '2: Розбийте їх у миску.', '3: Додайте сіль і перець.', '4: Добре збийте.', '5: Нагрійте сковорідку.', '6: Вилийте яйця на сковорідку.', '7: Готуйте до готовності.'];

for (let step = 0; step < recipe.length; step++){
    if (step === 2) {
        if (confirm('Бажаєте додати сіль?')) {
            console.log('Пропускаємо додавання солі');
            continue;
        }
    } else if (step === 4) {
        let question = prompt('Ти вже голодний?');
        if (question === 'Я вже голодний') {
            console.log("Ну, тоді їж сирі яйця 😅");
            break;
        }
    }
  